### 드래곤스파인 ( Type : AREA )

드래곤 스파인은 원신 게임에서 처음으로 개방된 지역으로, 몬드성 남쪽에 위치하고 있습니다³. 이 지역은 눈과 얼음으로 뒤덮여 있으며, 티바트 대륙에서 가장 황량한 지역 중 하나입니다³.

드래곤 스파인 지역에는 '혹한 게이지'라는 특별한 시스템이 존재합니다. 이 게이지는 환경 디버프로 작용하며, 혹한 게이지가 한계에 도달하면 캐릭터는 주기적으로 HP를 잃게 됩니다¹. 혹한 게이지는 모닥불, 횃불, 인동의 나무 근처로 가면 감소하며, 반대로 눈보라나 수영과 같은 환경에서는 혹한 게이지가 더 빠르게 차오릅니다¹.

또한, 이 지역에서는 바람.바위 신의 눈동자 대신 탐험을 통해 인동의 옥수를 수집할 수 있습니다. 이를 인동의 나무에게 가져가 공양하면 보상을 받을 수 있습니다¹.

이 외에도 드래곤 스파인 지역에는 다양한 퀘스트와 몬스터, 그리고 숨겨진 보물들이 존재하여 탐험의 재미를 더합니다². 이 모든 것들을 고려하면, 드래곤 스파인은 독특한 메커니즘과 함께 플레이어에게 새로운 도전과 탐험의 기회를 제공하는 지역이라고 할 수 있습니다.

In [3]:
word = 'Layla'
sent = 'Layla is cute'

In [4]:
word[0]

'L'

In [5]:
sent[0]

'L'

In [6]:
sent

'Layla is cute'

In [7]:
sent[0:5]

'Layla'

In [8]:
sent[:]

'Layla is cute'

In [9]:
sent[:len(sent)]

'Layla is cute'

In [10]:
sent[0:len(sent)]

'Layla is cute'

In [11]:
sent[-7:-3]

'is c'

In [12]:
'output : {0:4.6}'.format(7/67890)

'output : 0.000103108'

In [15]:
sent

'Layla is cute'

In [14]:
sent[-3:]

'ute'

In [16]:
word[:3]

'Lay'

In [17]:
word[0:3]

'Lay'

In [18]:
sent[4:]

'a is cute'

In [19]:
sent[:]

'Layla is cute'

In [20]:
sent[::2]

'Lyai ue'

In [21]:
a = 'Name : Layla'
b = 'StudentID : 20231111'
c = 'Hobby : Study'
d = 'Comment : Cute'

In [22]:
" ".join([a, b, c, d])

'Name : Layla StudentID : 20231111 Hobby : Study Comment : Cute'

In [23]:
strs = """Guard: What? Ridden en a horse?
Queen Raiden: Yes!
Guard: You're using coconuts!
Queen Raiden: What?
Guard: You've Got ... coconuts[s] and you're banaglin em together
"""

In [24]:
strs

"Guard: What? Ridden en a horse?\nQueen Raiden: Yes!\nGuard: You're using coconuts!\nQueen Raiden: What?\nGuard: You've Got ... coconuts[s] and you're banaglin em together\n"

In [25]:
strs.splitlines()[::2]

['Guard: What? Ridden en a horse?',
 "Guard: You're using coconuts!",
 "Guard: You've Got ... coconuts[s] and you're banaglin em together"]

In [26]:
strs.replace("Guard", "Yae Miko").splitlines()[::2]

['Yae Miko: What? Ridden en a horse?',
 "Yae Miko: You're using coconuts!",
 "Yae Miko: You've Got ... coconuts[s] and you're banaglin em together"]

In [27]:
'{} is very cute!'.format("Layla")

'Layla is very cute!'

In [29]:
print("""{0}은 매우매우 착하고 귀엽고 사랑스럽습니다.
이 사악한 {1}은 {0}을 괴롭히는 원인 중 하나입니다.""".format("레일라","나히다"))

레일라은 매우매우 착하고 귀엽고 사랑스럽습니다.
이 사악한 나히다은 레일라을 괴롭히는 원인 중 하나입니다.

In [30]:
'나히다는 {age} 살 이상이다.'.format(age = 500)

'나히다는 500 살 이상이다.'

In [31]:
'나는 내 통장에 {:,} 원이 있으면 좋겠다'.format(99999999999999999999999)

'나는 내 통장에 99,999,999,999,999,999,999,999 원이 있으면 좋겠다'

In [32]:
'output1 : {0:.3}, output 2 : {0:.3%}'.format(7/67890)

'output1 : 0.000103, output 2 : 0.010%'

In [34]:
'My Id code is {0:06d}'.format(12)

'My Id code is 000012'

In [36]:
'My love number is %d' % 10

'My love number is 10'

In [37]:
'%(name)s는 매우 귀엽지만, 그녀의 수면 시간은 %(time).2f시간으로 매우 짧다.' % ({'name' : '레일라', 'time' : 1.1631212})

'레일라는 매우 귀엽지만, 그녀의 수면 시간은 1.16시간으로 매우 짧다.'

In [38]:
name = '레일라'
month = 12
day = 19

In [39]:
f"{name}! {month}/{day} 생일 축하해!"

'레일라! 12/19 생일 축하해!'

In [40]:
import datetime

In [41]:
print(f"t1 : {datetime.datetime.now()}")
print(f"t2 : {datetime.datetime(1970, 1, 1)}")
print(f"t3 : {datetime.datetime(1970, 12, 12, 13, 24, 34)}")

t1 : 2023-12-17 21:42:17.025335
t2 : 1970-01-01 00:00:00
t3 : 1970-12-12 13:24:34

In [42]:
import re

In [44]:
ax = re.match(pattern='\d{10}', string = '1234567890')
ax

In [45]:
"match" if bool(ax) else "un match"

'match'

In [46]:
ax.start()

0

In [47]:
ax.end()

10

In [48]:
ax.span()

(0, 10)

In [50]:
ax.group()

'1234567890'

In [66]:
for i in ['123 4567 8901','(123) 456-7890', '+1 (123) 456-7890']:
    ax = re.match(pattern='(\+\d\s)?(\()?\d{3}(\))?\s\d{3,4}[-.\s]\d{4}', string = str(i))
    print(i if bool(ax) else "error")

123 4567 8901
(123) 456-7890
+1 (123) 456-7890

In [67]:
p = re.compile('\D{9}\:\d{4}')
p.match('localhost:8888')

In [68]:
my_exp = lambda x : x ** 2
my_exp_c = lambda x , n : x ** n

In [70]:
import pandas as pd

In [71]:
df = pd.DataFrame({
    'a' : [10, 20, 30],
    'b' : [20, 30, 40]
})

In [72]:
df

    a   b
0  10  20
1  20  30
2  30  40

In [73]:
df['a'] ** 2

0    100
1    400
2    900
Name: a, dtype: int64

In [74]:
printme = lambda x : print(x)

In [75]:
df.apply(printme)
# 기본적으로 열로 적용 ( axis = 0)/ 반전

0    10
1    20
2    30
Name: a, dtype: int64
0    20
1    30
2    40
Name: b, dtype: int64

a    None
b    None
dtype: object

In [77]:
df.apply(printme, axis = 1)
# axis 1로 주면 행으로 변경

a    10
b    20
Name: 0, dtype: int64
a    20
b    30
Name: 1, dtype: int64
a    30
b    40
Name: 2, dtype: int64

0    None
1    None
2    None
dtype: object

In [78]:
df['a'].apply(my_exp)

0    100
1    400
2    900
Name: a, dtype: int64

In [79]:
df['a'] ** 2

0    100
1    400
2    900
Name: a, dtype: int64

In [80]:
df['a'] ** 10

0        10000000000
1     10240000000000
2    590490000000000
Name: a, dtype: int64

In [81]:
df['a'].apply(my_exp_c, n = 10)

0        10000000000
1     10240000000000
2    590490000000000
Name: a, dtype: int64

In [82]:
def getmean(x):
    sum = 0
    for i in x:
        sum += i
    return sum / len(x)

In [84]:
df

    a   b
0  10  20
1  20  30
2  30  40

In [83]:
df.apply(getmean)

a    20.0
b    30.0
dtype: float64

In [85]:
df.apply(getmean, axis = 1)

0    15.0
1    25.0
2    35.0
dtype: float64

In [86]:
import numpy as np

In [87]:
df.apply(np.mean)

a    20.0
b    30.0
dtype: float64

In [88]:
df.apply(np.mean, axis = 1)

0    15.0
1    25.0
2    35.0
dtype: float64

In [90]:
import seaborn as sns

In [91]:
df = sns.load_dataset("titanic")

In [92]:
df

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [94]:
df['missing'] = df.apply(lambda x : pd.isnull(x).sum(), axis = 1)

In [95]:
df

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,missing
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,2
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,1
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,2
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,1
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,2
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True,2
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True,1
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False,3
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True,1
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True,2

In [96]:
df = sns.load_dataset("titanic")

In [97]:
getnan = lambda x : pd.isnull(x).sum()

In [98]:
df.apply(getnan, axis = 1)

0      1
1      0
2      1
3      0
4      1
      ..
886    1
887    0
888    2
889    0
890    1
Length: 891, dtype: int64

In [99]:
df['missing'] = df.apply(getnan, axis = 1)

In [100]:
df

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,missing
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,1
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,0
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,1
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,0
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True,1
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True,0
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False,2
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True,0
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True,1

In [101]:
getp = lambda x : (pd.isnull(x).sum() / len(x))

In [102]:
getp

In [112]:
a = df.apply(getp)
a

survived       0.000000
pclass         0.000000
sex            0.000000
age            0.198653
sibsp          0.000000
parch          0.000000
fare           0.000000
embarked       0.002245
class          0.000000
who            0.000000
adult_male     0.000000
deck           0.772166
embark_town    0.002245
alive          0.000000
alone          0.000000
missing        0.000000
dtype: float64

In [104]:
df.apply(getp, axis = 1)

0      0.0625
1      0.0000
2      0.0625
3      0.0000
4      0.0625
        ...
886    0.0625
887    0.0000
888    0.1250
889    0.0000
890    0.0625
Length: 891, dtype: float64

In [105]:
df.columns
# 열 ( axis - 0 로드 )

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone', 'missing'],
      dtype='object')

In [106]:
makep = lambda x : (pd.isnull(x).sum() / len(x)) * 100

In [107]:
makep

In [117]:
b = df.apply(makep)
b

survived        0.000000
pclass          0.000000
sex             0.000000
age            19.865320
sibsp           0.000000
parch           0.000000
fare            0.000000
embarked        0.224467
class           0.000000
who             0.000000
adult_male      0.000000
deck           77.216611
embark_town     0.224467
alive           0.000000
alone           0.000000
missing         0.000000
dtype: float64

In [109]:
nonnan = lambda x : 1 - (pd.isnull(x).sum() / len(x))

In [111]:
b = df.apply(nonnan)
b

survived       1.000000
pclass         1.000000
sex            1.000000
age            0.801347
sibsp          1.000000
parch          1.000000
fare           1.000000
embarked       0.997755
class          1.000000
who            1.000000
adult_male     1.000000
deck           0.227834
embark_town    0.997755
alive          1.000000
alone          1.000000
missing        1.000000
dtype: float64

In [113]:
a + b

survived       1.0
pclass         1.0
sex            1.0
age            1.0
sibsp          1.0
parch          1.0
fare           1.0
embarked       1.0
class          1.0
who            1.0
adult_male     1.0
deck           1.0
embark_town    1.0
alive          1.0
alone          1.0
missing        1.0
dtype: float64

In [114]:
nonnanp = lambda x : (1-(pd.isnull(x).sum() / len(x))) * 100

In [116]:
a = df.apply(nonnanp)
a

survived       100.000000
pclass         100.000000
sex            100.000000
age             80.134680
sibsp          100.000000
parch          100.000000
fare           100.000000
embarked        99.775533
class          100.000000
who            100.000000
adult_male     100.000000
deck            22.783389
embark_town     99.775533
alive          100.000000
alone          100.000000
missing        100.000000
dtype: float64

In [118]:
a + b

survived       100.0
pclass         100.0
sex            100.0
age            100.0
sibsp          100.0
parch          100.0
fare           100.0
embarked       100.0
class          100.0
who            100.0
adult_male     100.0
deck           100.0
embark_town    100.0
alive          100.0
alone          100.0
missing        100.0
dtype: float64

In [121]:
df['missing'] = df.apply(lambda x : pd.isnull(x).sum(), axis = 1)

In [122]:
df

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,missing
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,2
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,1
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,2
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,1
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,2
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True,2
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True,1
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False,3
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True,1
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True,2

In [123]:
df['missing'].value_counts()

2    549
1    182
3    160
Name: missing, dtype: int64

In [125]:
df.sample(200)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,missing
217,0,2,male,42.0,1,0,27.0000,S,Second,man,True,NaN,Southampton,no,False,2
839,1,1,male,NaN,0,0,29.7000,C,First,man,True,C,Cherbourg,yes,True,2
221,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True,2
323,1,2,female,22.0,1,1,29.0000,S,Second,woman,False,NaN,Southampton,yes,False,2
264,0,3,female,NaN,0,0,7.7500,Q,Third,woman,False,NaN,Queenstown,no,True,3
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
622,1,3,male,20.0,1,1,15.7417,C,Third,man,True,NaN,Cherbourg,yes,False,2
804,1,3,male,27.0,0,0,6.9750,S,Third,man,True,NaN,Southampton,yes,True,2
582,0,2,male,54.0,0,0,26.0000,S,Second,man,True,NaN,Southampton,no,True,2
183,1,2,male,1.0,2,1,39.0000,S,Second,child,False,F,Southampton,yes,False,1
734,0,2,male,23.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True,2

In [126]:
df[df['missing'] >= 2].sample(100)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,missing
352,0,3,male,15.0,1,1,7.2292,C,Third,child,False,NaN,Cherbourg,no,False,2
563,0,3,male,NaN,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,3
774,1,2,female,54.0,1,3,23.0000,S,Second,woman,False,NaN,Southampton,yes,False,2
313,0,3,male,28.0,0,0,7.8958,S,Third,man,True,NaN,Southampton,no,True,2
64,0,1,male,NaN,0,0,27.7208,C,First,man,True,NaN,Cherbourg,no,True,3
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
777,1,3,female,5.0,0,0,12.4750,S,Third,child,False,NaN,Southampton,yes,True,2
204,1,3,male,18.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,yes,True,2
169,0,3,male,28.0,0,0,56.4958,S,Third,man,True,NaN,Southampton,no,True,2
34,0,1,male,28.0,1,0,82.1708,C,First,man,True,NaN,Cherbourg,no,False,2
600,1,2,female,24.0,2,1,27.0000,S,Second,woman,False,NaN,Southampton,yes,False,2

In [128]:
df = pd.read_csv('../data/gapminder.tsv', sep = '\t')

In [129]:
df.groupby('year').lifeExp.mean()

year
1952    49.057620
1957    51.507401
1962    53.609249
1967    55.678290
1972    57.647386
1977    59.570157
1982    61.533197
1987    63.212613
1992    64.160338
1997    65.014676
2002    65.694923
2007    67.007423
Name: lifeExp, dtype: float64

In [130]:
df['year'].unique()

array([1952, 1957, 1962, 1967, 1972, 1977, 1982, 1987, 1992, 1997, 2002,
       2007], dtype=int64)